In [1]:
# Here we can rename the colunns of the DataFrame

In [3]:
# To rename columns, we can use the 'rename' method in the dataframe,
# But to get changes reflected in the original dataframe, we need to set the 'inplace' parameter to True.


import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 60000, 90000],
    'Department': ['HR', 'Finance', 'IT', 'IT']
}

# Create a DataFrame from the dictionary

df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
df

Original DataFrame:

      Name  Age         City  Salary Department
0    Alice   24     New York   70000         HR
1      Bob   27  Los Angeles   80000    Finance
2  Charlie   22      Chicago   60000         IT
3    David   32      Houston   90000         IT

In [4]:
# To rename columns, we can use the `rename` method of a pandas DataFrame.

df.rename(columns = {'Department': 'Dept'}, inplace = True)
df

      Name  Age         City  Salary     Dept
0    Alice   24     New York   70000       HR
1      Bob   27  Los Angeles   80000  Finance
2  Charlie   22      Chicago   60000       IT
3    David   32      Houston   90000       IT

In [5]:
# To find the unique values in a column, we can use the `unique` method.

df['Dept'].unique()

array(['HR', 'Finance', 'IT'], dtype=object)

In [7]:
# To count the values in a specified column, we can use the `value_counts` method.

df['Dept'].value_counts()

Dept
IT         2
HR         1
Finance    1
Name: count, dtype: int64

In [8]:
# To Create a new column known as 'Promoted Salary' by increasing the 'Salary' column by * 10.

df['Promoted Salary'] = df['Salary'] * 10
df

      Name  Age         City  Salary     Dept  Promoted Salary
0    Alice   24     New York   70000       HR           700000
1      Bob   27  Los Angeles   80000  Finance           800000
2  Charlie   22      Chicago   60000       IT           600000
3    David   32      Houston   90000       IT           900000